Tekla Open API Reference for Tekla Structures 2025
Surfacing.SurfacingAttributes Class
 The SurfacingAttributes class is the attributes class for the surfacing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.Surfacing.SurfacingAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SurfacingAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class SurfacingAttributes
	Inherits AttributesBase
The Surfacing.SurfacingAttributes type exposes the following members.
Constructors
Name | Description
Surfacing.SurfacingAttributes()
 Creates a new default surfacing attributes instance that loads standard attributes.
Surfacing.SurfacingAttributes(String)
 Creates a new surfacing attributes instance that loads the specified attributes.
Top
Properties
Name | Description
DrawHiddenLines
 True if hidden lines are drawn.
DrawOwnHiddenLines
 True if own hidden lines are enabled.
HiddenLines
 The line type of hidden lines.
Representation
 The representation type of the surfacing.
ShowPattern
 True if the pattern is shown.
VisibleLines
 The line type of visible lines.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace